// // 去网吧案例
// //---------------------------------------------------

// var age = prompt('请输入您的年龄');
// if (age >= 18) { //这里其实是自动把类型转化为了Number
//     alert('您满18岁啦');
//     alert(typeof age);
// }
// // if (Number(age) >= 18) {
// //     alert('您满18岁啦');
// // }
// else if (age >= 12) {
//     alert('防沉迷');
// } else {
//     alert('滚蛋');
// }



// //-------------------------------------------------------
// // 判断是否为闰年案例
// var year = prompt('请输入今年的年份');
// if (year % 4 == 0 && !(year % 100 == 0) || year % 400 == 0) {
//     alert('是闰年');
// } else {
//     alert('不是闰年');
// }


// // 独自完成的案例
// //---------------------------------------------------------
// var name1 = prompt('输入“我要中奖”即可中将');
// if (name1 == '我要中奖') {
//     alert('恭喜您中了一等奖');
// } else {
//     alert('未中奖');
// }

//分数等级
//----------------------------------------------------------------
var score = prompt('请输入获得的分数');
if (score >= 90) {
    alert('A');
} else if (score >= 80) {
    alert('B');
} else if (score >= 70) {
    alert('C');
} else if (score >= 60) {
    alert('D');
} else {
    alert('E');
}